# Data cleaning and completion for table: GeneralData

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from pathlib import Path
import os
import sys

sys.path.append('../')

In [2]:
os.getcwd()

'/home/michael/Projects/DSlab2/data-science2-lab-final-project/src/team_4'

In [3]:
# Load the provided Excel file
# The data is present in the data folder two directories up
data_dir = os.path.abspath(os.path.join(os.getcwd(),"..","data"))
dataset_path = os.path.join(data_dir, "rehospitalization.xlsx")
OutPutDate = os.path.join(data_dir, 'GeneralData.csv')

In [4]:
# Load the 'GeneralData' sheet into a DataFrame for cleaning and completion
general_data_df = pd.read_excel(dataset_path, sheet_name='GeneralData')

# Display the first few rows to understand the structure and identify potential issues
general_data_df.head()

,Patient,age,Gender,גורם משלם,משקל,גובה,BMI,מחלות כרוניות,השכלה,מספר ילדים,מצב משפחתי,תרופות קבועות
0,1043772,84,זכר,כללית,92.0,170.0,34.2,1,ללא,3,נשוי,"10815 , 11282 , 1183 , 1196 , 12758 , 13027 ,..."
1,77493,89,נקבה,‎ממון עצמי-לא מב‎,45.0,150.0,21.4,0,NaN,1,גרוש,"10337 , 1130 , 1448 , 1466 , 186 , 2482 , 290..."
2,37680,87,זכר,‎ממון עצמי-לא מב‎,67.7,165.0,24.9,0,פנסיונר,2,נשוי,"1183 , 1310 , 2451 , 2566 , 4967 , 6718 , 672..."
3,70066,90,נקבה,מאוחדת,94.0,165.0,31.6,0,NaN,1,גרוש,"1100 , 1181 , 1182 , 1183 , 12757 , 1283 , 12..."
4,13616,87,זכר,כללית,70.0,163.0,26.3,0,NaN,3,נשוי,"10214 , 1212 , 12725 , 2882 , 6737 , 7852 , 7..."

In [5]:
def summary(df):
    nonnans = df.shape[0] - df.isna().sum()
    nonnansPrc = (nonnans / df.shape[0] * 100).apply("{0:.2f}%".format)
    sam = df.sample(1, random_state=42).squeeze()
    res = pd.DataFrame([sam.index, df.dtypes.astype(str), nonnans,
                        nonnansPrc, df.nunique(), sam]).transpose()
    res.columns = ["Column", "data type", "non-null values", 
                   "non-null values %", "unique values", "example"]
    res.sort_values("unique values",ascending=False, inplace=True)
    return res

In [6]:
summary(general_data_df)

,Column,data type,non-null values,non-null values %,unique values,example
0,Patient,int64,4535,100.00%,4535,144443
11,תרופות קבועות,object,4495,99.12%,4490,"1183 , 2213 , 5913"
8,השכלה,object,2641,58.24%,648,NaN
6,BMI,float64,3504,77.27%,308,28.3
4,משקל,float64,3718,81.98%,177,80.0
5,גובה,float64,3698,81.54%,83,168.0
1,age,int64,4535,100.00%,42,98
9,מספר ילדים,object,4373,96.43%,21,2
3,גורם משלם,object,4524,99.76%,7,‎ממון עצמי-לא מב‎
10,מצב משפחתי,object,4474,98.65%,5,נשוי
2,Gender,object,4535,100.00%,2,זכר
7,מחלות כרוניות,int64,4535,100.00%,2,0

## Education  
education column contains a lot of free form text and requires special treatment.

In [7]:
general_data_df.rename(columns={"השכלה": "education"},inplace=True)
general_data_df.education = general_data_df.education.fillna("")
general_data_df.education = general_data_df.education.astype(str)

In [8]:
import re
def spl(n):
    if n!=None:
        return re.split(', |\. | |,|\.|\\|- |-|\/|\+|\(|\)', str(n))
    else:
        return [""]

def token_analysis(col,sortby = "cnt", ascending=False):
    #"token"
    names = col.apply(func=spl).values.tolist()
    #print(names)
    words = sum(names,[])
    
    unique, counts = np.unique(words, return_counts=True)
    wc = pd.DataFrame({"token":unique, "cnt": counts})
    
    tokens = wc.sort_values(sortby,ascending=ascending).reset_index(drop=True)
    return tokens

First, let's see what kind of words can we see in the column  
Analyze frequencies of all unique words in the education column

In [9]:
ta = token_analysis(general_data_df['education'])
print(ta.shape)
ta.head(20)

(643, 2)

        token   cnt
0              2053
1     פנסיונר   595
2   פנסיונרית   403
3          לא   269
4       פנסיה   165
5        עובד   160
6       עובדת   143
7     גימלאית    88
8         בית    84
9      גימלאי    75
10       עקרת    70
11     גמלאית    51
12      גמלאי    50
13       מורה    47
14   פנסיוניר    46
15   פנסיונרת    37
16        נהג    34
17       אחות    27
18       מנהל    27
19       בעבר    25

In [10]:
#ta.to_excel("tokens.xlsx")

### Manual labor
We observe a total of 644 unique words in the entire education column. 
Not a huge amount, so can be manually separated into 5 groups:

 - Pension: all the words indicating the persion is a pensioner. due to manual manner of input and human mistake, there are 56 variations of that word. examles: `גמלאית גמלאי פנסיוניר פנסיונרת`
  - Role: the employment role that a person had before, ex: `מנהל  אחות  מהנדס  חקלאי  רופא`
  - Assignment: more granular description of person's employment, ex: `מסחר  מכניקה מזגנים  נהיגה`
  - Status: words indicating person's disabled status, ex: `נכה  שוהה  שכלית מצבו`
  - Negation: variants of "No", mostly used to indicate the person is not working. ex: `רלוונטי  ללא  אינה`
  - Junk: words that do not bear significance for the research at hand, such as prepositions, temporal indicators, given names, etc. ex: `היה  כרגע  כיום  היתה  במקצוע  רפתי בלוונשטיין`
  
The separation is done by moving a word into appropriate column in an excel document. The final version is provided in the tokens_dict.xlsx file

### text patterns in the column

once the classification of words is complete, we can use the excel file as our token database to classify the descritions in 'education' column

In [11]:
tokdic = pd.read_excel("tokens_dict.xlsx")

In [12]:
# eliminate null values from tokens_dict.xlsx that appeared as a result of manually moving cells in excel document
for col in tokdic.columns:
    tmp = tokdic[col][~tokdic[col].isna()].reset_index(drop=True)
    tokdic[col] = tmp.sort_values().reset_index(drop=True)
tokdic.dropna(axis = 0, how="all")

,pension,pension_n,assignment,assignment_n,role,role_n,status,status_n,negation,negation_n,junk,junk_n
0,בגמלאות,1.0,Jשמל,1.0,אב,1.0,בשבץ,1.0,אין,1.0,אגד,1.0
1,בפנסיה,1.0,אבטחה,1.0,אגרונום,1.0,חולה,1.0,אינה,10.0,איש,1.0
2,גימאלית,1.0,אדמניסטרטיבי,1.0,אומן,1.0,מצבו,1.0,אינו,13.0,אתו,1.0
3,גימלאי,1.0,אוויר,1.0,אונקולוג,1.0,נכה,1.0,לא\s?,15.0,בארקיע,1.0
4,גימלאית,1.0,אווירית,1.0,אחות,1.0,נכות,1.0,ללא,22.0,בבעברו,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...
313,NaN,NaN,תעשיה,9.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
314,NaN,NaN,תעשייה,10.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
315,NaN,NaN,תעשייתי,11.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
316,NaN,NaN,תפירה,17.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
317,NaN,NaN,תקשורת,84.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
symbols = {'pension': 'P',     
           'assignment': 'A',    
           'role': 'R',       
           'status': 'S',  
           'negation': 'N',
           'junk': 'J'}

In [14]:
# extra len column for sorting the tokens by their length
# required to prevent shorter words to be extracted before longer ones
# e.g: 'fortitude' should be extracted before 'for', otherwise  we'll end up with 'titude' 
tokendb = tokdic.loc[:,list(symbols.keys())]
tokendb.loc[:,'len'] = tokendb['pension'].str.len()

We will first try to identify whether there are standard patterns of descriptions in this column
By replacing each word with a symbol that indicate it's group, we can reduce all the descriptions into a limited amount of templates.

In [15]:
def research(text, patt, grp=0):       
    result = re.search(patt, text)
    return result.group(grp) if result else None

def construct_pattern(col):
    tokendb.loc[:,'len'] = tokendb[col].str.len()
    tdb = tokendb.sort_values(['len',col], ascending=False)
    patt_col = tdb.loc[~tdb[col].isna(),col]
    patt_col = [re.escape(patt) for patt in patt_col]
    pattern = "|".join(patt_col)
    return pattern

pattern = []
syms = []

pattern.append('\d+([,.]\d+)?') 
syms.append('J')
for tok, sym in symbols.items():    
    #tokens = 'pension'
    pattern.append(construct_pattern(tok))
    syms.append(sym) 
     
pattern.append(r'(, |\. |,|\.|\\|- |-|\/|\+|\(|\))+')
syms.append(' ')



def split_name2(text):

    templ = str(text)        
    status=[]
    role = []
    assgn = []
    job = []
    for pat, sym in zip(pattern, syms):
        found = re.findall(pat, templ)
        if found:
            if sym == 'P':
                status.append("pension")
            if sym == 'N':
                status.append("not working")
            if sym == 'S':
                status.append("disabled")
            if sym == 'R':
                job.append(found)
            if sym == 'A':
                job.append(found)
                
        templ = re.sub(pat, sym, templ).strip()
    job = sum(job,[])
    job.reverse()
    job = " ".join(job)
    status = " ".join(status)
    return {"template": templ, "status": status,"job": job}

In [16]:
data = general_data_df[["education"]].dropna()# .loc[:1000]
data

             education
0                  ללא
1
2              פנסיונר
3
4
...                ...
4530  אלקטרונאי בפנסיה
4531
4532           פנסיונר
4533             תיווך
4534

[4535 rows x 1 columns]

In [17]:
applied_df = data.apply(lambda row: split_name2(row.education), axis='columns', result_type='expand')
df = pd.concat([data, applied_df], axis='columns')

In [18]:
df[~df.job.isna()]

             education template       status        job
0                  ללא        N  not working
1
2              פנסיונר        P      pension
3
4
...                ...      ...          ...        ...
4530  אלקטרונאי בפנסיה      R P      pension  אלקטרונאי
4531
4532           פנסיונר        P      pension
4533             תיווך        A                   תיווך
4534

[4535 rows x 4 columns]

However, upon examination, this technique proved to be not robust enough.

### N-grams
Since the content in education is a free-form text, the order and connection between words is important. 
N-grams is a simple, yet powerful technique for this kind of problem. 


We will use 2 and 3 -grams to identify word combinations that are frequent in the dataset, hopefully helping us to extract meaningful and concese dscription of person' employment.

before extracting ngrams, we clear the input from garbage, such as punctuation, numbers and junk words.
Also we extract status by searching for any instances of 'pension', 'not working' or 'disabled'

In [19]:
def extract_clear(text):
    text = str(text)
    text = re.sub('\d+([,.]\d+)?', "", text).strip()
    text = re.sub(r'"|(, |\. |,|\.|\\|- |-|\/|\+|\(|\))+', "", text).strip()
    words = text.split(" ")
    job = []    
    status=""  

    for word in words:          
        if word in tokendb.negation.values :
            status = "not working"
            continue
        if word in tokendb.pension.values  :
            status = "pension"
            continue           
        if word in tokendb.status.values  :
            status = "disabled"
            continue
        if word in tokendb.assignment.values  :
            job.append(word)
            continue
        if word in tokendb.role.values  :
            job.append(word)
            continue       

    job = " ".join(job) # recombine content that remains after cleaning
    return {"status": status,"job": job}

In [20]:
edu_data = general_data_df[["education"]].dropna()

In [21]:
applied_df = edu_data.apply(lambda row: extract_clear(row.education), axis='columns', result_type='expand')
edu_data = pd.concat([edu_data, applied_df], axis='columns')
edu_data.head()

  education       status job
0       ללא  not working
1
2   פנסיונר      pension
3
4

In [22]:
import nltk

In [23]:
nltk.download('punkt_tab',)

[nltk_data] Downloading package punkt_tab to
[nltk_data]     /home/michael/nltk_data...
[nltk_data]   Package punkt_tab is already up-to-date!

True

In [24]:
def ngrams(item, n=2):
    item = str(item)
    patt = r'(, |\. |,|\.|\\|- |-|\/|\+|\(|\))+'
    item = re.sub(patt, " ", item)
    tokens = nltk.word_tokenize(item)
    return list(nltk.ngrams(tokens, n))

In [25]:
# extract all bigrams and trigrams from the entire job column
bigrams = sum(edu_data.job.apply(ngrams, n=2),[])
trigrams = sum(edu_data.job.apply(ngrams, n=3),[])

In [26]:
# for every bi and trigram, calculate it's frequency
BigramFD = nltk.FreqDist(bigrams)
TrigramFD = nltk.FreqDist(trigrams)

In [27]:
# for a given description, identify which bi or trigram is the most likely to describe the job of the person
# This is based on an assumption that common job titles will appear more frequently in the entire dataset than 
# unrelated text
# additionally, to equalize the chances between the bi and trigrams, we multiply the freq by 2 or 3 respectively 

def best_ngram(job):
    bigrams = ngrams(job,n=2)
    if bigrams==[]:
        return job
    bgs = {bg: BigramFD[bg]*2 for bg in bigrams}
    
    trigrams = ngrams(job,n=3)
    tgs = {tg: TrigramFD[tg]*3 for tg in trigrams}
    bgs.update(tgs)

    gram = max(bgs, key=bgs.get)
    return " ".join(gram)

In [28]:
applied_df = edu_data.apply(lambda row: best_ngram(row.job), axis='columns', result_type='expand')
edu_data["job"] = applied_df

In [29]:
test = edu_data[edu_data.education.str.contains(" ")]
test[:50]

,education,status,job
5,פנסיה. לפני בטקסטיל.,,בטקסטיל
9,עסק פרטי - בעלת חנות,,עסק פרטי
20,יועץ לאדריכלים,,יועץ לאדריכלים
32,לא עובדת,,
33,לא עובדת גימלאית .,pension,
51,חינוך מיוחד,,חינוך מיוחד
55,נהג אוטובוס,,נהג אוטובוס
57,עצמאי מכניקה,,עצמאי מכניקה
59,"גימלאי, עבד כמסגר",,כמסגר
77,לא עובד,,
114,לא עובד,,
120,ראדיולוג לשעבר,,ראדיולוג
121,"גימלאי צה""ל",pension,צהל
122,בעבר גנן - לא עובד בשל מצבו הרפואי ( חולה דיאל...,disabled,גנן
128,עובד מחשבים,,מחשבים
132,הנדסאית פנסונירת,pension,הנדסאית
137,עדיין עובדת במשק בית,,במשק בית
141,לא עובדת,,
145,עובדת ניקיון. לא עובדת כעת,,
149,פנסיונר-עורך דין,,דין
151,חנות פרקטים,,חנות פרקטים
171,משרד תיכון,,תיכון
175,לא עובד,,
178,לא עובד,,
179,"תפירה בעברה , פנסיונרית",pension,תפירה
197,"פנסיונר, עבד בחברת טבע",,טבע
198,לא עובדת,,
201,לא עובד,,
205,בונה צעצועים,,בונה צעצועים
210,נציג יצרנים,,נציג יצרנים
216,עסק של וילונות,,עסק וילונות
217,סוכנת נסיעו בפנסיה,pension,סוכנת נסיעו
219,לא עובד,,
234,משרד בטחון,,בטחון
235,מורה בפנסיה,pension,מורה
241,לא עובדת,,
243,פרופסור לרפואה,,פרופסור לרפואה
245,בעברה פקידה בבנק,,פקידה בבנק
248,לא עובד,,
250,עקרת בית,,עקרת בית
253,איש אחזקה באינבורסיטה,,אחזקה באינבורסיטה
258,רופא שיניים,,רופא שיניים
270,לא עובדת,,
271,מעצבת מטבחים,,מעצבת מטבחים
274,פנסיונר - רופא משפחה,pension,רופא משפחה
282,מורה לאנגלית,,מורה לאנגלית
286,לא עובד,,
294,מטפלת גמלאית,pension,מטפלת
311,"פנסיונרית, רופאה בעבר",,
314,מהנדס אלקטרוניקה,,מהנדס אלקטרוניקה

We will store this data separately for now, as otherwise it will complicate the translation part.   

Below are the most common job titles we found:

In [30]:
unique, counts = np.unique(edu_data.job, return_counts=True)
wc = pd.DataFrame({"token":unique, "cnt": counts})

alljobs = wc.sort_values("cnt",ascending=False).reset_index(drop=True)
print(alljobs.shape)
alljobs[:50]

(409, 2)

            token   cnt
0                  3773
1        עקרת בית    68
2            אחות    24
3            מורה    24
4           חקלאי    14
5           מהנדס    14
6           עצמאי    13
7       נהג מונית    11
8             נהג    10
9            רופא    10
10           גננת     8
11         מזכירה     7
12         מחשבים     7
13         חשמלאי     7
14          מאבטח     6
15      בגן ילדים     6
16     קבלן בניין     6
17      נהג משאית     6
18          מטפלת     5
19          בניין     5
20  מנהלת חשבונות     5
21        בית ספר     5
22          כלכלן     5
23          הוראה     5
24         חקלאות     5
25           מסגר     5
26            צהל     5
27          פקידה     5
28       במשק בית     4
29            גנן     4
30     רואה חשבון     4
31    נהג אוטובוס     4
32          ספרית     4
33            נגר     4
34           חנות     3
35          במפעל     3
36          רוקחת     3
37    רופא שיניים     3
38            בנק     3
39           מנהל     3
40   מורה לאנגלית     3
41    מורה בתיכון     3
42    מהנדס בניין     3
43         מכירות     3
44         מהנדסת     3
45          מובטל     3
46          טכנאי     3
47        משק בית     3
48          שמירה     3
49       עסק פרטי     3

In [31]:
#alljobs.to_csv("alljobs.csv", index = False)

### Categorization

At this point we've managed to reduce trhe amount of classes of jobs to 400.
This is still way too much for a classification algorithm.  

Hence we point to modern AI technology to perform the final step.
We request ChatGPT to map these 400 jobs into couple dozen broad categories.
We are able to reduce the amount of categories to 30 
The result is very good, it is provided in file jobs_mapping.csv

In [32]:
jm = pd.read_csv("jobs_mapping.csv") #, na_filter='NaN' )

In [33]:
# inject mapping for empty value
e = pd.DataFrame({"token": [""], "mapping": ["Unknown"]}, index=[len(jm)])
jm = pd.concat([jm,e],axis=0)

In [34]:
# validate that all the mappings exist in edu_data
my = set(edu_data.job.values)

test = [a for a in jm.token.values if a in my]

len(test)

409

This is a summary of how many jobs each broad category maps to

In [35]:
from pandasql import  sqldf
q = """
select mapping, count(token) as jobs
from jm
group by mapping 
order by jobs desc

"""
wat = sqldf(q)
wat
#print("\n".join(wat.mapping))

                 mapping  jobs
0             Healthcare    49
1         Skilled Trades    40
2              Education    36
3                 Retail    34
4                Finance    23
5             Government    21
6         Administration    20
7           Construction    17
8         Transportation    15
9            Engineering    14
10               Unknown    13
11  Arts & Entertainment    13
12              Security    12
13         Manufacturing    12
14           Agriculture    12
15            Technology    10
16     Domestic Services     8
17               Tourism     7
18              Services     7
19         Food Services     6
20       Social Services     5
21    Science & Research     5
22             Logistics     5
23            Consulting     5
24         Self-Employed     4
25           Real Estate     4
26           Maintenance     4
27             Childcare     4
28                 Media     3
29                   Law     2

In [36]:
jmd = {item[1]["token"]: item[1]["mapping"] for item in jm.iterrows() }

In [37]:
edu_data["jobcat"] = edu_data.job.map(jmd, na_action='ignore')

In [38]:
edu_data[edu_data.jobcat.isna()]

Empty DataFrame
Columns: [education, status, job, jobcat]
Index: []

In [39]:
#edu_data.to_excel("temp.xlsx")

## Translate hebrew content into english 

Hebrew text, being an RTL language, presents a great challenge when writing code, hence we want to translate it.
Thankfully, by omitting education column, we remain with a very limited set of values to translate.
We use Team 11 approach and code for this.

In [40]:
del general_data_df["education"]

In [41]:
from  team_11.task7.task7 import translate_dataframe, extract_hebrew_content, contains_hebrew

In [42]:
content = extract_hebrew_content(general_data_df)

In [43]:
content

{'columns': ['גורם משלם',
  'משקל',
  'גובה',
  'מחלות כרוניות',
  'מספר ילדים',
  'מצב משפחתי',
  'תרופות קבועות'],
 'content': ['זכר',
  'נקבה',
  'כללית',
  '\u200eממון עצמי-לא מב\u200e',
  'מאוחדת',
  'מכבי',
  'לאומית',
  '\u200eשרות בתי הסוהר\u200e',
  '\u200eתייר/תעריף מלא\u200e',
  '1 + 2 (נפטרו)',
  '2( ילדים בחוץ לארץ)',
  'נכדה  אחת',
  'אין',
  'נשוי',
  'גרוש',
  'אלמן',
  'רווק',
  'פרוד']}

In [44]:
c = content['columns'] + content['content'] 
c

['גורם משלם',
 'משקל',
 'גובה',
 'מחלות כרוניות',
 'מספר ילדים',
 'מצב משפחתי',
 'תרופות קבועות',
 'זכר',
 'נקבה',
 'כללית',
 '\u200eממון עצמי-לא מב\u200e',
 'מאוחדת',
 'מכבי',
 'לאומית',
 '\u200eשרות בתי הסוהר\u200e',
 '\u200eתייר/תעריף מלא\u200e',
 '1 + 2 (נפטרו)',
 '2( ילדים בחוץ לארץ)',
 'נכדה  אחת',
 'אין',
 'נשוי',
 'גרוש',
 'אלמן',
 'רווק',
 'פרוד']

In [45]:
# Manual labor: 
# take output of c, put it into google translate, paste the translated text as t:
# correct any mistakes or redundant values if necessary
t = ['Paying factor', 'Weight', 'Height', 'Chronic diseases',
     'Number of children', 'Marital status', 'Regular medications',
     'Male', 'Female', 'General', 'Self-financed Not from', 'Mauhedat',
     'Maccabi', 'National', 'Prison services', 'Tourist/full rate', '1 + 2 (deceased)',
     '2 ( children abroad)', 'one granddaughter', 'none', 'married', 'divorced', 
     'widowed', 'single', 'separated']

In [46]:
# copy-paste the output of d as translate_dict
d ={k:v for k,v in zip(c,t)}
d

{'גורם משלם': 'Paying factor',
 'משקל': 'Weight',
 'גובה': 'Height',
 'מחלות כרוניות': 'Chronic diseases',
 'מספר ילדים': 'Number of children',
 'מצב משפחתי': 'Marital status',
 'תרופות קבועות': 'Regular medications',
 'זכר': 'Male',
 'נקבה': 'Female',
 'כללית': 'General',
 '\u200eממון עצמי-לא מב\u200e': 'Self-financed Not from',
 'מאוחדת': 'Mauhedat',
 'מכבי': 'Maccabi',
 'לאומית': 'National',
 '\u200eשרות בתי הסוהר\u200e': 'Prison services',
 '\u200eתייר/תעריף מלא\u200e': 'Tourist/full rate',
 '1 + 2 (נפטרו)': '1 + 2 (deceased)',
 '2( ילדים בחוץ לארץ)': '2 ( children abroad)',
 'נכדה  אחת': 'one granddaughter',
 'אין': 'none',
 'נשוי': 'married',
 'גרוש': 'divorced',
 'אלמן': 'widowed',
 'רווק': 'single',
 'פרוד': 'separated'}

In [47]:
translate_dict= {'גורם משלם': 'Paying agent',
 'משקל': 'Weight',
 'גובה': 'Height',
 'מחלות כרוניות': 'Chronic diseases',
 'מספר ילדים': 'Number of children',
 'מצב משפחתי': 'Marital status',
 'תרופות קבועות': 'Regular medications',
 'זכר': 'Male',
 'נקבה': 'Female',
 'כללית': 'Clalit',
 'ממון עצמי-לא מב': 'Self-financed',
 'מאוחדת': 'Meuhedet',
 'מכבי': 'Maccabi',
 'לאומית': 'Leumit',
 'שרות בתי הסוהר': 'Prison services',
 'תייר/תעריף מלא': 'Tourist/full rate',
 "1 2 \u05e0\u05e4\u05d8\u05e8\u05d5": "3",
 "2 \u05d9\u05dc\u05d3\u05d9\u05dd \u05d1\u05d7\u05d5\u05e5 \u05dc\u05d0\u05e8\u05e5": "2",
 "\u05e0\u05db\u05d3\u05d4 \u05d0\u05d7\u05ea": "1",
 'אין': 'none',
 'נשוי': 'married',
 'גרוש': 'divorced',
 'אלמן': 'widowed',
 'רווק': 'single',
 'פרוד': 'separated'}

In [48]:
general_data_df = translate_dataframe(general_data_df, translate_dict )

In [49]:
# validate that all the hebrew text was translated.
# the columns and content are supposed to be empty.
# if not, that's probably due to special characters 
check = extract_hebrew_content(general_data_df)
check

{'columns': [], 'content': []}

In [50]:
general_data_df

,Patient,age,Gender,Paying agent,Weight,Height,BMI,Chronic diseases,Number of children,Marital status,Regular medications
0,1043772,84,Male,Clalit,92.0,170.0,34.2,1,3,married,"10815, 11282, 1183, 1196, 12758, 13027, 1333, ..."
1,77493,89,Female,Self-financed,45.0,150.0,21.4,0,1,divorced,"10337, 1130, 1448, 1466, 186, 2482, 2907, 3261..."
2,37680,87,Male,Self-financed,67.7,165.0,24.9,0,2,married,"1183, 1310, 2451, 2566, 4967, 6718, 6720, 6737..."
3,70066,90,Female,Meuhedet,94.0,165.0,31.6,0,1,divorced,"1100, 1181, 1182, 1183, 12757, 1283, 12946, 13..."
4,13616,87,Male,Clalit,70.0,163.0,26.3,0,3,married,"10214, 1212, 12725, 2882, 6737, 7852, 7999, 92..."
...,...,...,...,...,...,...,...,...,...,...,...
4530,5473,82,Male,Self-financed,69.0,180.0,21.3,0,3,married,"1150, 1682, 2043, 2150, 2188, 2566, 2606, 2897..."
4531,980451,79,Male,Maccabi,64.0,170.0,22.1,0,4,married,NaN
4532,430555,99,Male,Clalit,60.0,170.0,20.8,0,3,widowed,"12284, 2384, 2412, 2791, 2843, 3211, 3298, 347..."
4533,737553,75,Male,Maccabi,97.0,170.0,33.6,0,3,married,"1183, 12730, 1637, 2568, 37, 3724, 4856, 6432,..."
4534,769513,94,Female,Maccabi,65.0,165.0,26.7,0,3,widowed,"10201, 1183, 12722, 1357, 1443, 1466, 1841, 20..."

In [51]:
# Check for missing data
# Get basic statistics to identify potential outliers and data ranges
summary(general_data_df)

,Column,data type,non-null values,non-null values %,unique values,example
0,Patient,int64,4535,100.00%,4535,144443
10,Regular medications,object,4495,99.12%,4490,"1183, 2213, 5913"
6,BMI,float64,3504,77.27%,308,28.3
4,Weight,float64,3718,81.98%,177,80.0
5,Height,float64,3698,81.54%,83,168.0
1,age,int64,4535,100.00%,42,98
8,Number of children,object,4373,96.43%,21,2
3,Paying agent,object,4524,99.76%,7,Self-financed
9,Marital status,object,4474,98.65%,5,married
2,Gender,object,4535,100.00%,2,Male
7,Chronic diseases,int64,4535,100.00%,2,0

In [52]:
pd.DataFrame(general_data_df.describe()).transpose()

,count,mean,std,min,25%,50%,75%,max
Patient,4535.0,360635.420507,325399.296102,31.00,87996.50,241523.0,602290.0,1171452.0
age,4535.0,80.147078,8.640097,65.00,73.00,80.0,87.0,111.0
Weight,3718.0,75.901668,147.942371,30.00,61.85,72.0,83.0,9036.8
Height,3698.0,165.239313,29.634842,1.58,160.00,165.0,170.0,1765.0
BMI,3504.0,1229.321946,29376.471228,3.20,23.40,26.3,30.0,830000.0
Chronic diseases,4535.0,0.137155,0.344049,0.00,0.00,0.0,0.0,1.0

In [53]:
# Identify outliers in 'BMI', 'weight', and 'height'
# For BMI, assume normal human range is 10 to 60
bmi_outliers = general_data_df[(general_data_df['BMI'] < 10) | (general_data_df['BMI'] > 60)]

# For weight, assume normal human range is 30 to 300 kg
weight_outliers = general_data_df[(general_data_df['Weight'] < 30) | (general_data_df['Weight'] > 300)]

# For height, assume normal human range is 140 to 210 cm
height_outliers = general_data_df[(general_data_df['Height'] < 140) | (general_data_df['Height'] > 210)]

bmi_outliers, weight_outliers, height_outliers

(      Patient  age  Gender   Paying agent  Weight  Height       BMI  \
 137   1132829   82  Female         Clalit    57.5    57.5     492.5
 348    112253   82    Male         Clalit    88.0    80.0     137.5
 658     51497   94    Male  Self-financed   165.0    60.0     458.3
 664    184567   91  Female  Self-financed    64.0   450.0       3.2
 1114   823081   93    Male        Maccabi    80.0    48.0     694.4
 1268    53726   85  Female       Meuhedet    60.0    58.0     178.4
 1285   178335   87  Female        Maccabi    63.0   200.0  630000.0
 1448   128998   73    Male         Clalit    75.0   172.0  750000.0
 1620   755744   81    Male         Clalit    80.0   178.0      69.9
 2233   172354   78    Male         Clalit    83.0   170.0  830000.0
 2488   205368   80    Male         Clalit    56.0    65.0     132.5
 2671   289488   72    Male         Clalit    74.0    74.0     319.6
 2700   197599   70    Male  Self-financed    70.0   165.0  700000.0
 2816   740114   70    Male         Clalit   168.0   100.0     168.0
 2926   266415   91  Female         Clalit    60.0    60.0     444.4
 3044   118747   68    Male         Clalit    83.0   200.0  800000.0
 3245    31075   67    Male         Clalit    90.0    50.0      75.0
 3389   229072   89  Female         Clalit    90.0   165.0      62.4
 3902   198895   97  Female        Maccabi    50.0   160.0  500000.0
 4450     9824   92  Female         Clalit    91.0    76.0      95.2

       Chronic diseases Number of children Marital status  \
 137                  0                  0        widowed
 348                  1                  2        widowed
 658                  0                  4        married
 664                  0                 10        widowed
 1114                 0                  3        married
 1268                 0                  1        widowed
 1285                 1                  1        widowed
 1448                 0                  4        married
 1620                 0                  5        widowed
 2233                 0                  5        married
 2488                 0                  3        married
 2671                 0                NaN            NaN
 2700                 0                  6        married
 2816                 1                  4        married
 2926                 0                  3        widowed
 3044                 1                  4        married
 3245                 0                  1       divorced
 3389                 0                  9        widowed
 3902                 1                  2        widowed
 4450                 0                  2        widowed

                                     Regular medications
 137                   2606, 2791, 2821, 4560, 783, 9508
 348   11435, 11523, 12426, 12725, 1443, 1873, 2187, ...
 658   11052, 1114, 1183, 149, 2213, 2309, 2614, 2882...
 664   1183, 12288, 12757, 140, 1457, 1842, 2187, 218...
 1114  2606, 3318, 3484, 3485, 3531, 5913, 6413, 696,...
 1268  11240, 1294, 1443, 2043, 3298, 366, 4539, 4945...
 1285      11240, 2791, 5456, 630, 7080, 7135, 7884, 929
 1448  11240, 1183, 1438, 1443, 1981, 2188, 2443, 260...
 1620  10246, 11240, 1183, 1312, 1457, 2043, 33, 3815...
 2233  2213, 2606, 2624, 3495, 4774, 4856, 630, 6490,...
 2488  1981, 2213, 2624, 3459, 3568, 3571, 4328, 4640...
 2671  1026, 11008, 12591, 12833, 1590, 1639, 2188, 2...
 2700  10411, 1183, 2188, 2607, 2791, 31, 319, 320, 3...
 2816  10201, 1639, 1739, 2043, 2188, 2791, 2905, 591...
 2926  1183, 2495, 2808, 4553, 4560, 4860, 630, 8422,...
 3044  1175, 1183, 12278, 138, 1530, 2043, 2187, 2188...
 3245  1183, 12316, 1550, 1552, 183, 2109, 2781, 2940...
 3389  1015, 1183, 12550, 1443, 1527, 1851, 2043, 218...
 3902  10589, 10648, 11030, 1183, 1530, 214, 4437, 44...
 4450  1115, 1183, 1229, 1443, 2188, 2612, 2945, 31, ...  ,
       Patient  age Gender Paying agent  Weight  Height   BMI  \
 2736   377264   72   Male      Maccabi  9036.8   175.0  35.6

       Chronic diseases Number of children Marital status  \
 2736                 0                  2       divorced

                                     Regular medications
 2736  1183, 1192, 1194, 12933, 1530, 182, 183, 184, ...  ,
       Patient  age  Gender   Paying agent  Weight   Height    BMI  \
 137   1132829   82  Female         Clalit    57.5    57.50  492.5
 258    281776   73    Male        Maccabi   173.0   100.00    NaN
 348    112253   82    Male         Clalit    88.0    80.00  137.5
 404    101142   80    Male         Clalit    90.0     1.80    NaN
 463    265477   82    Male         Clalit    80.0    80.00   29.4
 599     98907   97    Male  Self-financed   170.0    60.00    NaN
 658     51497   94    Male  Self-financed   165.0    60.00  458.3
 664    184567   91  Female  Self-financed    64.0   450.00    3.2
 1003    85028   85  Female         Clalit    35.0   135.00   19.2
 1114   823081   93    Male        Maccabi    80.0    48.00  694.4
 1227   157362   77  Female         Clalit    51.2    66.50   18.8
 1268    53726   85  Female       Meuhedet    60.0    58.00  178.4
 1343   912319   83  Female        Maccabi    50.0   139.00    NaN
 1546   298270   82    Male  Self-financed   165.0    71.00    NaN
 1972    46086   78  Female  Self-financed    60.0    60.00    NaN
 2018   111603   85  Female         Clalit    30.0   130.00   17.8
 2356    13940   80  Female         Clalit    85.0    85.00   33.2
 2434   146267   86    Male         Clalit    56.0     1.60    NaN
 2488   205368   80    Male         Clalit    56.0    65.00  132.5
 2671   289488   72    Male         Clalit    74.0    74.00  319.6
 2816   740114   70    Male         Clalit   168.0   100.00  168.0
 2851   182258   68    Male       Meuhedet   104.0    75.00   34.0
 2914    65493   71    Male         Clalit    84.0    70.00   28.4
 2926   266415   91  Female         Clalit    60.0    60.00  444.4
 3003     2496   66    Male         Clalit    88.0    76.00    NaN
 3053   124715   66  Female         Clalit    65.0   138.00   34.1
 3112   171677   67  Female         Clalit    80.0    60.00   31.6
 3245    31075   67    Male         Clalit    90.0    50.00   75.0
 3634   109268   93  Female  Self-financed    62.0  1765.00   24.2
 3845    13665   67  Female         Clalit   104.0     1.58    NaN
 3861   543664   85  Female  Self-financed   158.0    57.00    NaN
 3964     7712   77    Male         Clalit    75.0    64.00   26.0
 4224    77789   79  Female  Self-financed    62.0    52.00   26.8
 4242   556798   85  Female         Clalit    52.0   136.00   28.1
 4378   729360   90    Male       Meuhedet    80.0    80.00   29.4
 4450     9824   92  Female         Clalit    91.0    76.00   95.2

       Chronic diseases Number of children Marital status  \
 137                  0                  0        widowed
 258                  0                  6        married
 348                  1                  2        widowed
 404                  0                  3        married
 463                  0                  2        married
 599                  0                  3        widowed
 658                  0                  4        married
 664                  0                 10        widowed
 1003                 0                  1        widowed
 1114                 0                  3        married
 1227                 0                  3        married
 1268                 0                  1        widowed
 1343                 0                  5        widowed
 1546                 0                  6        married
 1972                 0                  3        married
 2018                 0                  3        married
 2356                 1                  3        widowed
 2434                 0                  6        married
 2488                 0                  3        married
 2671                 0                NaN            NaN
 2816                 1                  4        married
 2851                 1                  3        married
 2914                 0                  4        married
 2926                 0                  3        widowed
 3003                 0                  4        married
 3053                 0                  2        married
 3112                 0                  2       divorced
 3245                 0                  1       divorced
 3634                 0                  2        widowed
 3845                 0                  2        married
 3861                 1                  5        widowed
 3964                 0                  4        married
 4224                 0                  4        married
 4242                 0                  3        widowed
 4378                 0                  3        married
 4450                 0                  2        widowed

                                     Regular medications
 137                   2606, 2791, 2821, 4560, 783, 9508
 258   10660, 1183, 1189, 1191, 1199, 1236, 1443, 146...
 348   11435, 11523, 12426, 12725, 1443, 1873, 2187, ...
 404                        1231, 2188, 3706, 6232, 6464
 463   1183, 12675, 2606, 2944, 32, 3610, 4600, 5947,...
 599   11176, 1231, 12598, 2212, 2483, 2624, 2791, 34...
 658   11052, 1114, 1183, 149, 2213, 2309, 2614, 2882...
 664   1183, 12288, 12757, 140, 1457, 1842, 2187, 218...
 1003  12310, 2187, 2212, 2412, 3002, 3296, 3570, 359...
 1114  2606, 3318, 3484, 3485, 3531, 5913, 6413, 696,...
 1227  1183, 13610, 138, 1637, 1841, 2127, 2944, 4553...
 1268  11240, 1294, 1443, 2043, 3298, 366, 4539, 4945...
 1343          1639, 2214, 37, 630, 643, 6737, 7135, 948
 1546  10591, 1183, 1256, 12740, 13151, 2213, 2624, 2...
 1972  1183, 2697, 415, 4212, 4437, 4553, 7999, 9010,...
 2018  1437, 2212, 2213, 2474, 2624, 2900, 3150, 321,...
 2356  10460, 1194, 12757, 189, 198, 2043, 2187, 2482...
 2434  1310, 1312, 1637, 2127, 2351, 2567, 2624, 2707...
 2488  1981, 2213, 2624, 3459, 3568, 3571, 4328, 4640...
 2671  1026, 11008, 12591, 12833, 1590, 1639, 2188, 2...
 2816  10201, 1639, 1739, 2043, 2188, 2791, 2905, 591...
 2851        2187, 2606, 2624, 2791, 37, 401, 4437, 5913
 2914  10252, 10965, 11009, 11518, 1194, 12278, 1530,...
 2926  1183, 2495, 2808, 4553, 4560, 4860, 630, 8422,...
 3003  1103, 1183, 1194, 1231, 1236, 1310, 1443, 1448...
 3053  2606, 2624, 3163, 32, 3502, 4269, 5913, 630, 7...
 3112  1183, 1448, 1462, 1466, 1515, 1516, 1519, 2187...
 3245  1183, 12316, 1550, 1552, 183, 2109, 2781, 2940...
 3634  140, 2047, 2212, 2354, 2549, 2791, 345, 3531, ...
 3845  10675, 1443, 2188, 2309, 2624, 2690, 2791, 338...
 3861  12279, 1243, 12740, 2482, 2606, 3394, 4560, 46...
 3964  1183, 1194, 1212, 12370, 12543, 140, 2188, 221...
 4224  1183, 1184, 12946, 1443, 1530, 2043, 2188, 237...
 4242  140, 1509, 2187, 2581, 2624, 2726, 2791, 3083,...
 4378  1120, 1183, 1243, 1457, 2040, 2187, 2213, 3459...
 4450  1115, 1183, 1229, 1443, 2188, 2612, 2945, 31, ...  )

In [54]:
# Replace outliers in BMI, weight, and height with NaN
general_data_df.loc[(general_data_df['BMI'] < 10) | (general_data_df['BMI'] > 60), 'BMI'] = np.nan
general_data_df.loc[(general_data_df['Weight'] < 30) | (general_data_df['Weight'] > 300), 'Weight'] = np.nan
general_data_df.loc[(general_data_df['Height'] < 140) | (general_data_df['Height'] > 210), 'Height'] = np.nan

# Recalculate BMI for entries where weight and height are available
general_data_df['BMI'] = general_data_df['Weight'] / ((general_data_df['Height'] / 100) ** 2)

# Display summary of changes
general_data_df[['BMI', 'Weight', 'Height']].describe()

               BMI      Weight       Height
count  3655.000000  3717.00000  3662.000000
mean     26.688510    73.49088   165.584926
std       5.334254    16.68483     8.653187
min      13.064305    30.00000   140.000000
25%      23.183391    61.80000   160.000000
50%      25.951557    72.00000   165.000000
75%      29.386256    83.00000   170.000000
max      78.125000   200.00000   200.000000

In [55]:

# Filling missing values for categorical data using mode
general_data_df['Paying agent'].fillna(general_data_df['Paying agent'].mode()[0], inplace=True)
#general_data_df['השכלה'].fillna(general_data_df['השכלה'].mode()[0], inplace=True)
general_data_df['Marital status'].fillna(general_data_df['Marital status'].mode()[0], inplace=True)

# Filling missing values for numeric data using median
general_data_df['Weight'].fillna(general_data_df['Weight'].median(), inplace=True)
general_data_df['Height'].fillna(general_data_df['Height'].median(), inplace=True)
general_data_df['BMI'].fillna(general_data_df['BMI'].median(), inplace=True)
#general_data_df['Number of children'].fillna(general_data_df['Number of children'].median(), inplace=True)

# Checking if there are any remaining missing values
summary(general_data_df)

/tmp/ipykernel_2006413/4243214794.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  general_data_df['Paying agent'].fillna(general_data_df['Paying agent'].mode()[0], inplace=True)
/tmp/ipykernel_2006413/4243214794.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  general_data_df['Marital status'].fillna(general_data_df['Marital status'].mode()[0], inplace=True)
/tmp/ipykernel_2006413/4243214794.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  general_data_df['Weight'].fillna(general_data_df['Weight'].median(), inplace=True)
/tmp/ipykernel_2006413/4243214794.py:8: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  general_data_df['Height'].fillna(general_data_df['Height'].median(), inplace=True)
/tmp/ipykernel_2006413/4243214794.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  general_data_df['BMI'].fillna(general_data_df['BMI'].median(), inplace=True)

,Column,data type,non-null values,non-null values %,unique values,example
0,Patient,int64,4535,100.00%,4535,144443
10,Regular medications,object,4495,99.12%,4490,"1183, 2213, 5913"
6,BMI,float64,4535,100.00%,1257,28.344671
4,Weight,float64,4535,100.00%,176,80.0
5,Height,float64,4535,100.00%,55,168.0
1,age,int64,4535,100.00%,42,98
8,Number of children,object,4373,96.43%,21,2
3,Paying agent,object,4535,100.00%,7,Self-financed
9,Marital status,object,4535,100.00%,5,married
2,Gender,object,4535,100.00%,2,Male
7,Chronic diseases,int64,4535,100.00%,2,0

In [56]:
general_data_df['Number of children'].unique()

array([3, 1, 2, 4, 0, 7, 5, 8, 6, nan, 10, 9, '3', 11, '4 4', 12, '2', 13,
       15, 14, '1', 'none'], dtype=object)

In [57]:
# Attempt to clean 'מספר ילדים' column by converting entries to numeric values
# We'll extract the first number before any non-numeric characters

import re

def extract_numeric(value):
    if isinstance(value, str):
        # Extract the first number that appears in the string
        match = re.search(r'\d+', value)
        if match:
            return int(match.group(0))
        else:
            return np.nan
    return value

# Apply the function to clean the 'מספר ילדים' column
general_data_df['Number of children'] = general_data_df['Number of children'].apply(extract_numeric)

# Now try filling missing values with the median
general_data_df['Number of children'].fillna(general_data_df['Number of children'].median(), inplace=True)

# Check the column to ensure it's clean and filled
general_data_df['Number of children'].describe()

/tmp/ipykernel_2006413/3294783957.py:20: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  general_data_df['Number of children'].fillna(general_data_df['Number of children'].median(), inplace=True)

count    4535.000000
mean        3.272326
std         2.062258
min         0.000000
25%         2.000000
50%         3.000000
75%         4.000000
max        15.000000
Name: Number of children, dtype: float64

In [58]:
general_data_df["status"] =  edu_data["status"]
general_data_df["job"] =  edu_data["job"]
general_data_df["jobcat"] =  edu_data["jobcat"]
general_data_df

,Patient,age,Gender,Paying agent,Weight,Height,BMI,Chronic diseases,Number of children,Marital status,Regular medications,status,job,jobcat
0,1043772,84,Male,Clalit,92.0,170.0,31.833910,1,3.0,married,"10815, 11282, 1183, 1196, 12758, 13027, 1333, ...",not working,,Unknown
1,77493,89,Female,Self-financed,45.0,150.0,20.000000,0,1.0,divorced,"10337, 1130, 1448, 1466, 186, 2482, 2907, 3261...",,,Unknown
2,37680,87,Male,Self-financed,67.7,165.0,24.866850,0,2.0,married,"1183, 1310, 2451, 2566, 4967, 6718, 6720, 6737...",pension,,Unknown
3,70066,90,Female,Meuhedet,94.0,165.0,34.527089,0,1.0,divorced,"1100, 1181, 1182, 1183, 12757, 1283, 12946, 13...",,,Unknown
4,13616,87,Male,Clalit,70.0,163.0,26.346494,0,3.0,married,"10214, 1212, 12725, 2882, 6737, 7852, 7999, 92...",,,Unknown
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4530,5473,82,Male,Self-financed,69.0,180.0,21.296296,0,3.0,married,"1150, 1682, 2043, 2150, 2188, 2566, 2606, 2897...",pension,אלקטרונאי,Technology
4531,980451,79,Male,Maccabi,64.0,170.0,22.145329,0,4.0,married,NaN,,,Unknown
4532,430555,99,Male,Clalit,60.0,170.0,20.761246,0,3.0,widowed,"12284, 2384, 2412, 2791, 2843, 3211, 3298, 347...",pension,,Unknown
4533,737553,75,Male,Maccabi,97.0,170.0,33.564014,0,3.0,married,"1183, 12730, 1637, 2568, 37, 3724, 4856, 6432,...",,תיווך,Real Estate
4534,769513,94,Female,Maccabi,65.0,165.0,23.875115,0,3.0,widowed,"10201, 1183, 12722, 1357, 1443, 1466, 1841, 20...",,,Unknown

In [59]:
# Fill missing values in 'תרופות קבועות' using the mode of the column
general_data_df['Regular medications'].fillna(general_data_df['Regular medications'].mode()[0], inplace=True)

# Verify that there are no remaining missing values
summary(general_data_df)

/tmp/ipykernel_2006413/1460784401.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  general_data_df['Regular medications'].fillna(general_data_df['Regular medications'].mode()[0], inplace=True)

,Column,data type,non-null values,non-null values %,unique values,example
0,Patient,int64,4535,100.00%,4535,144443
10,Regular medications,object,4535,100.00%,4490,"1183, 2213, 5913"
6,BMI,float64,4535,100.00%,1257,28.344671
12,job,object,4535,100.00%,409,
4,Weight,float64,4535,100.00%,176,80.0
5,Height,float64,4535,100.00%,55,168.0
1,age,int64,4535,100.00%,42,98
13,jobcat,object,4535,100.00%,30,Unknown
8,Number of children,float64,4535,100.00%,16,2.0
3,Paying agent,object,4535,100.00%,7,Self-financed
9,Marital status,object,4535,100.00%,5,married
11,status,object,4535,100.00%,4,
2,Gender,object,4535,100.00%,2,Male
7,Chronic diseases,int64,4535,100.00%,2,0

In [60]:
# Save the updated dataset to a new Excel File
general_data_df.to_excel(OutPutDate, index=False)

In [61]:
from datetime import datetime
print("last full run: ", datetime.now().strftime("%Y.%m.%d-%H.%M.%S"))

last full run:  2024.09.09-19.20.17